note/2018/cool-uri-does-not-change/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-13 Thu 12:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cool URI Does not Change</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="/note/style.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/note"> UP </a>
 |
 <a accesskey="H" href="/note"> HOME </a>
</div><div id="content">
<h1 class="title">Cool URI Does not Change</h1>
<p>
I recently read this article: <a href="https://www.w3.org/Provider/Style/URI">Cool URIs don't change</a>. (found it on this <a href="https://ambrevar.xyz/blog-architecture/">blog</a>)
</p>

<p>
To summary:
</p>
<ol class="org-ol">
<li>URI (should) never change</li>
<li>As a webmaster (I like this word!) you should name URIs to last.</li>
<li>To design a ever-lasting URI:
<ul class="org-ul">
<li>What to use in URI:
<ol class="org-ol">
<li>Created time, it never changes. For example the year.
Another advantage of using created year is that,
when you refer back to <code>/2018/pics/</code> 200 years later,
you know that it mean what <code>pic</code> means in 2018 instead of in 2218.</li>
</ol></li>
<li>What to leave out (basically anything that might change):
<ol class="org-ol">
<li>Authors name.</li>
<li>Subject. The author of the original article claims that it changes
surprisingly fast.</li>
<li>Access. Like group access, personal access, public access, etc.</li>
<li>File name extension.</li>
<li>Software mechanisms. Such as <code>cgi</code>, <code>exce</code>, <code>rb</code>, etc.</li>
</ol></li>
</ul></li>
</ol>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-09-11 Tue 00:00</p>
<p class="author">Author: Yuan Fu</p>
<p class="date">Created: 2018-09-13 Thu 12:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
